Repository: impworks/mirelle
Catalog: MirelleCompiler/Resources.*.resx
Languages: ru_ru

# errAutoconstructInherited
source: An inherited type cannot be autoconstructed!
ru_ru: Унаследованный тип не может содержать автоконструктор!

# errAutoconstructNoFields
source: Type '{0}' contains no fields and cannot be autoconstructed!
ru_ru: Тип '{0}' не содержит полей, поэтому невозможно создать автоконструктор!

# errAutoconstructRepeated
source: This type has already been marked as autoconstructed!
ru_ru: Этот тип уже помечен как автоконструируемый!

# errConstExpected
source: A constant value is expected!
ru_ru: Требуется константа!

# errExtendBuiltInType
source: The type '{0}' is built-in and cannot be extended with methods and properties!
ru_ru: Тип '{0}' является встроенным и не может быть расширен свойствами и методами!

# errFieldAtmarkExpected
source: A field name should start with a @ sign!
ru_ru: Имя поля должно начинаться с символа @!

# errFieldNameExpected
source: A field name is expected!
ru_ru: Требуется имя поля!

# errFieldOutsideType
source: A field cannot be used outside methods of a type!
ru_ru: Поле не может быть использовано вне методов своего типа!

# errFieldRedefinition
source: A field named '{0}' already exists in type '{1}'!
ru_ru: Поле '{0}' уже объявлено в типе '{1}'!

# errFileAlreadyCompiled
source: File '{0}' was already compiled!
ru_ru: Файл '{0}' уже скомпилирован!

# errFileNotFound
source: File '{0}' was not found!
ru_ru: Файл '{0}' не найден!

# errIncludePathExpected
source: A file name or path is expected!
ru_ru: Требуется имя файла или путь!

# errIncorrectSignature
source: '{0}' is not a valid expression type signature!
ru_ru: '{0}' не является подписью типа!

# errInheritBuiltInType
source: The type '{0}' is built-in and cannot be inherited from!
ru_ru: Тип '{0}' является встроенным и не может использоваться при наследовании!

# errMethodCurlyBrace
source: Method body should be enclosed in curly braces!
ru_ru: Тело метода должно быть окружено фигурными скобками!

# errMethodNameExpected
source: A method name is expected!
ru_ru: Требуется имя метода!

# errMethodNotFoundInType
source: No method named '{0}' accepting '{1}' was found in type '{2}'!
ru_ru: Метод '{0}' принимающий '{1}' не был найден в типе '{2}'!

# errMethodRedefinition
source: A method named '{0}' already exists in type '{1}' and has identical set of parameters!
ru_ru: Метод '{0}' с таким же набором параметров уже объявлен в типе '{1}'!

# errNewLineExpected
source: A statement should be terminated with a newline!
ru_ru: Выражение должно заканчиваться переводом строки!

# errNotAllPathsReturn
source: Not all code paths in method '{0}' return a value!
ru_ru: Не все пути потока выполнения в методе '{0}' возвращают значение!

# errParameterNameDuplicated
source: Parameter named '{0}' is already defined for this method!
ru_ru: Параметр '{0}' уже объявлен в данном методе!

# errParameterNameExpected
source: A parameter name is expected!
ru_ru: Требуется имя параметра!

# errParamSeparatorExpected
source: Parameters must be separated by commas!
ru_ru: Параметры метода должны разделяться запятыми!

# errReturnTypeMismatch
source: Method '{0}' requires return type '{1}', cannot return a '{2}'!
ru_ru: Метод '{0}' объявлен как '{1}' и не может возвращать '{2}'!

# errReturnVoidExpected
source: Method '{0}' is declared as 'void' and cannot return a value!
ru_ru: Метод '{0}' объявлен как 'void' и не может возвращать значения!

# errTypeCurlyBrace
source: Type body should be enclosed in curly braces!
ru_ru: Тело типа должно быть окружено фигурными скобками!

# errTypeNameExpected
source: A type name is expected!
ru_ru: Требуется имя типа!

# errTypeNotFound
source: Type '{0}' is not defined!
ru_ru: Тип '{0}' не объявлен!

# errTypeParentNotFound
source: Cannot define type '{0}' because parent type '{1}' is not defined!
ru_ru: Нельзя объявить тип '{0}', поскольку родительский тип '{1}' не объявлен!

# errTypeRedefinition
source: Type '{0}' was already defined!
ru_ru: Тип '{0}' уже объявлен!

# errTypeSignatureExpected
source: A type signature is expected!
ru_ru: Требуется подпись типа!

# errTypeUnknownStmt
source: A type body can only consist of field and method definitions!
ru_ru: Тело типа может содержать только описания свойств и методов!

# errUnknownLexem
source: Unknown lexem!
ru_ru: Неизвестная лексема!

# errVariableNameExpected
source: A variable name is expected!
ru_ru: Требуется имя переменной!

# errVariableRedefinition
source: A variable named '{0}' already exists in current scope!
ru_ru: Переменная '{0}' уже объявлена в данном контексте!

# errVariableUndefined
source: A variable named '{0}' is not defined!
ru_ru: Переменная '{0}' не объявлена!

# errVoidAssign
source: The variable '{0}' cannot be assigned a void!
ru_ru: Нельзя присвоить переменной '{0}' выражение без типа!

# errVoidCompoundType
source: Cannot create an array or a matrix of voids!
ru_ru: Нельзя создать массив элементов без типа!

# errReturnOutsideMethod
source: Return statements are only allowed inside a method!
ru_ru: Оператор return может быть использован только в теле метода!

# errBlockCurlyBrace
source: A code block should be enclosed in curly braces!
ru_ru: Блок кода должен содержаться в фигурных скобках!

# errDoExpected
source: The 'do' keyword is expected!
ru_ru: Требуется ключевое слово 'do'!

# errInExpected
source: The 'in' keyword is expected!
ru_ru: Требуется ключевое слово 'in'!

# errUseTypeDuplicated
source: The type '{0}' has already been marked as 'used'!
ru_ru: Тип '{0}' уже был открыт с помощью директивы 'use'!

# errVariableAssignmentExpected
source: Variables should be assigned a value at declaration!
ru_ru: Для объявления переменной требуется ее значение по умолчанию!

# errIdentifierExpected
source: A field or a method name is expected!
ru_ru: Требуется имя метода или поля!

# errSquareBracketExpected
source: A square bracket is expected!
ru_ru: Требуется квадратная скобка!

# errFieldInvoke
source: '{0}' is a field and cannot be invoked like a method!
ru_ru: '{0}' является полем и не может быть вызвано, как метод!

# errExpressionExpected
source: Expecting a constant, array, variable, method call, object creation or a subexpression in parens!
ru_ru: Требуется константа, массив, переменная, поле, вызов метода, оператор new или выражение в скобках!

# errLvalueExpected
source: It's only possible to assign to a variable, field, array or matrix item!
ru_ru: Слева от знака присваивания может стоять только переменная, поле, элемент массива или матрицы!

# errTypeNesting
source: Types cannot be nested!
ru_ru: Типы не могут быть вложенными!

# errGlobalStmtInLocal
source: The 'use' and 'include' commands cannot be nested!
ru_ru: Команды 'use' и 'include' должны располагаться на верхнем уровне вложенности кода!

# errBreakRedoOutsideLoop
source: Loop control statements must be inside a loop!
ru_ru: Конструкции управления циклом должны находиться внутри цикла!

# errIndexingNotAnArray
source: The lefthand expression is not an array!
ru_ru: Выражение слева от индексатора не является массивом!

# errParenExpected
source: A closing paren is expected!
ru_ru: Требуется закрывающая круглая скобка!

# errAssignTypeMismatch
source: Assignment target and expression must be of the same type, cannot assign '{0}' to '{1}'!
ru_ru: Переменная и выражение должны быть совместимых типов, нельзя присвоить выражение '{0}' в переменную типа '{1}'!

# errFieldNotFound
source: Field '{0}' does not exist in type '{1}'!
ru_ru: Поле '{0}' не объявлено в типе '{1}'!

# errIdentifierUnresolved
source: The identifier '{0}' does not exist in current context!
ru_ru: Идентификатор '{0}' не найден в данном контексте!

# errTypeIdentifierUnresolved
source: The type '{0}' does not have a field or a method named '{1}'!
ru_ru: Тип '{0}' не содержит поля или метода без параметров под названием '{1}'!

# errDynamicFromStatic
source: '{0}' is not static and cannot be accessed from a static context!
ru_ru: '{0}' не является статическим, поэтому не может быть использован из статического контекста!

# errOperatorTypesMismatch
source: Operator '{0}' cannot be used on types '{1}' and '{2}'!
ru_ru: Оператор '{0}' не может использоваться на объектах типов '{1}' и '{2}'!

# errGlobalMethodNotFound
source: Method '{0}' was not found in any visible types!
ru_ru: Метод '{0}' не найден ни в одном открытом типе!

# errReturnExpressionExpected
source: A return expression is expected!
ru_ru: Требуется выражение для оператора return!

# errConstructorNotFound
source: The type '{0}' does not have a constructor accepting '{1}'!
ru_ru: Тип '{0}' не содержит конструктора, принимающего параметры '{1}'!

# errIncomparableTypes
source: Types '{0}' and '{1}' cannot be compared!
ru_ru: Невозможно сравнить объекты типов '{0}' и '{1}'!

# errRelationIncomparableTypes
source: Objects of type '{0}' cannot be compared as 'less' and 'greater'!
ru_ru: Объекты типа '{0}' не имеют отношений 'меньше' или 'больше'!

# errUnaryOperatorNumericExpected
source: Expecting an int or a float value for the '{0}' operator!
ru_ru: Оператор '{0}' требует выражение целого или дробного типа!

# errRangeLimitsIntExpected
source: Range limits must be of 'int' type!
ru_ru: Пределы для объекта класса 'range' должны быть целочисленными!

# errForIterableExpected
source: An array, range or dict expression is expected for iteration!
ru_ru: Требуется массив, объект класса 'range' или 'dict' для итерации!

# errBinaryOperatorIntExpected
source: Binary operations can only be performed on integers!
ru_ru: Бинарные операции могут проводиться только на целых числах!

# errBoolExpected
source: A boolean expression is expected!
ru_ru: Требуется выражение логического типа!

# errInvalidCast
source: Cannot cast object of type '{0}' to type '{1}'!
ru_ru: Невозможно привести объект типа '{0}' к типу '{1}'!

# errCastArray
source: Array types cannot be casted!
ru_ru: Массивы нельзя приводить к типу!

# errSpecialIncorrectReturnType
source: The special method '{0}' must return a '{1}'!
ru_ru: Специальный метод '{0}' должен возвращать объект типа '{1}'!

# errVoidExpression
source: Cannot use a void function or null value as a part of expression!
ru_ru: Функции без возвращаемого значения и null нельзя использовать в выражениях!

# errAmbigiousCall
source: The call to method '{0}' is ambigious: at least '{1}' and '{2}' match!
ru_ru: Вызов метода '{0}' неоднозначен: подходят по крайней мере '{1}' и '{2}' !

# errThisInStaticContext
source: The self-reference cannot used in a static context!
ru_ru: Указатель @ недоступен в статическом контексте!

# errVariableDefinedNull
source: A type specifier is required when defining a variable! Please cast the null to desired type using the 'as' operator!
ru_ru: При объявлении переменной требуется спецификатор типа! Используйте оператор 'as' для приведения null к желаемому типу.

# errInvalidNullCast
source: Cannot cast a null-pointer to type '{0}'!
ru_ru: Невозможно привести null к типу '{0}'!

# errNonStaticMethod
source: '{0}' cannot be called as a static method!
ru_ru: '{0}' нельзя вызвать как статический метод!

# errNullAccessor
source: Cannot invoke methods or access fields of an unspecified type!
ru_ru: Null не содержит методов и свойств!

# errInvertType
source: Cannot invert an object of type '{0}'!
ru_ru: Невомзожно обратить объект типа '{0}'!

# errStaticConstructor
source: The constructor in type '{0}' cannot be marked as static!
ru_ru: Конструктор в типе '{0}' не может быть помечен как статический!

# errEmptyMatrix
source: A matrix must contain at least one item!
ru_ru: Матрица должна содержать по крайней мере 1 элемент!

# errMatrixLineLengthMismatch
source: Each line in a must contain equal number of items ('{0}'), but line {1} has {2} items!
ru_ru: Все строки матрицы должны содержать равное число элементов ('{0}'), но на строке {1} содержится {2} элементов!

# errMatrixItemTypeMismatch
source: A matrix item can only be an int or a float expression!
ru_ru: Элементом матрицы может быть только выражение целочисленного или дробного типа!

# errDoubleSquareBracketExpected
source: A matrix-closing double square bracket is expected!
ru_ru: Требуется двойная квадратная скобка, закрывающая литерал матрицы!

# errIndexingNotAMatrix
source: The lefthand expression is not a matrix!
ru_ru: Выражение слева от индексатора не является матрицей!

# errIntIndexExpected
source: An array or matrix index must be of 'int' type!
ru_ru: Индекс массива или матрицы должен быть целочисленным!

# errMatrixInExpression
source: A matrix must be assigned to a variable before it can be used in an expression!
ru_ru: Матрица должна быть присвоена переменной, прежде чем использовать ее в выражениях!

# errMatrixExpressionParensExpected
source: Expressions within a matrix literal must be enclosed in parens!
ru_ru: Выражения внутри литерала матрицы должны быть обернуты в скобки!

# errCommaExpected
source: A comma is expected!
ru_ru: Требуется запятая!

# errSplatArrayExpected
source: The expression must be an array to use splat assignment!
ru_ru: Для разделяющего присваивания требуется выражение-массив!

# errIntFloatExpected
source: An integer or a float expression is expected!
ru_ru: Требуется выражение целочисленного или дробного типа!

# errTildeExpected
source: A tilde (~) is expected!
ru_ru: Требуется волнистая черта (~)!

# errTypeParentDefaultCtor
source: The parent type, '{0}', must have a default constructor!
ru_ru: Для наследования тип '{0}' должен содержать конструктор по умолчанию!

# errTimeSpanExpected
source: An emitter definition must contain either "with" or "every" clause, or both!
ru_ru: Описание источника события должно содержать раздел 'with', 'every', или оба!

# errEmitConditionExpected
source: Emitter condition must be a boolean expression!
ru_ru: Условие для источника событий должно быть логическим выражением!

# errEmitDistributionExpected
source: Emitter distribution expected!
ru_ru: Распределение для источника событий должно быть объектом класса distr!

# errEmitLimitExpected
source: Emitter event limit must be an integer!
ru_ru: Предел создаваемых событий для источника должен быть целочисленным!

# errEmitStepExpected
source: Emitter step must be a floating point number or an integer!
ru_ru: Временной шаг создаваемых событий для источника должен быть целочисленным или дробным!

# errClosuredMember
source: Local fields and methods cannot be used in closures!
ru_ru: Локальные поля и методы нельзя использовать в замыканиях!

# errClosuredThis
source: The @ pointer cannot be used in closures!
ru_ru: Указатель @ нельзя использовать в замыканиях!

# errMethodNotFound
source: No method named '{0}' accepting '{1}' was found!
ru_ru: Метод '{0}' принимающий '{1}' не был найден!

# errDefaultConstructorNotFound
source: The type '{0}' does not have a default constructor!
ru_ru: Тип '{0}' не содержит конструктора по умолчанию!

# errEmptyArray
source: An array must contain at least one item!
ru_ru: Массив должен содержать по крайней мере 1 элемент!

# errArrayItemNull
source: A type specifier is required when defining an array! Please cast the null to desired type using the 'as' operator!
ru_ru: При объявлении массива требуется спецификатор типа! Используйте оператор 'as' для приведения null к желаемому типу.

# errConstantOverflow
source: The constant value is either too large or too small for it's type!
ru_ru: Константа слишком велика или слишком мала для данного типа!

# errArrayTypeMismatch
source: Cannot add an item of type '{0}' to an array of '{1}'!
ru_ru: Нельзя добавить элемент типа '{0}' в массив типа '{1}'!

# errEnumParent
source: Enums cannot inherit from types!
ru_ru: Перечислимые типы не могут наследоваться!

# errEnumRedefinition
source: The value named '{0}' already exists in the enum '{1}'!
ru_ru: Значение '{0}' уже существует в перечислимом типе '{1}'!

# errInheritEnum
source: Cannot inherit from '{0}' because it's an enum, not a type!
ru_ru: Нельзя унаследовать обычный тип от перечисляемого типа '{0}'!

# errEnumValueNameExpected
source: An enum value name is expected!
ru_ru: Требуется имя значения перечислимого типа!

# errSpecialInEnum
source: The '{0}' identifier is special and cannot be a an enum value!
ru_ru: Идентификатор '{0}' является специальным и не может быть использован в качестве значения для перечислимого типа!

# errVariableDefinitionOnly
source: The variable definition cannot be the only statement in the code block!
ru_ru: Объявление переменной не может быть единственным выражением в блоке кода!

# errPlannerArgsMismatch
source: The planner method must accept two parameters: 'flow[]' and 'symbol'!
ru_ru: Метод планировщика должен принимать два аргумента: 'flow[]' и 'symbol'!

# errPlannerExpression
source: Expecting a planner method name, either static or instance-based, without parameters!
ru_ru: Требуется имя метода планировщика, статического или экземплярного, без параметров!

# errPlannerTypeMismatch
source: The planner method must return a 'symbol'!
ru_ru: Метод планировщика должен возвращать 'symbol'!

# errUnexpectedLexem
source: Unexpected '{0}'.
ru_ru: Неожиданный тип лексемы: '{0}'.

# errSimulateMultiple
source: Cannot have multiple planner simulations within one program!
ru_ru: В одной программе может быть только один оператор симуляции планировщика!

# errDictItemTypeMismatch
source: A dict key or value must be a string expression!
ru_ru: Ключи и значения в словаре должны быть строкового типа!

# errDictArrowExpected
source: A key-value separator '=>' is expected!
ru_ru: Требуется разделитель ключа и значения '=>'!

# errDictCurlyBrace
source: A dict literal must be enclosed in curly braces!
ru_ru: Литерал dict должен быть окружен фигурными скобками!

# errStringExpected
source: A string expression is expected!
ru_ru: Требуется строковое выражение!

# errAtExpected
source: The keyword 'at' is expected after 'once'!
ru_ru: Требуется ключевое слово 'at' после 'once'!

# errDictIterKeyRequired
source: Both key and item variables must be specified when iterating a dict! To iterate keys or values only, use the dict.keys and dict.values methods in the 'in' clause!
ru_ru: Для обхода объекта dict требуется указание двух переменных - для ключа и для значения! Чтобы использовать только ключи или только значения, используйте dict.keys и dict.values соответствтенно.

# errDictKeyExpected
source: Expecting a string, an identifier or an expression in parens for a dict key!
ru_ru: Требуется идентификатор, строка или выражение в скобках в качестве ключа для dict!

# errArrayExpressionParensExpected
source: Expression within an array literal must be enclosed in parens!
ru_ru: Выражение внутри литерала массива должно быть обернуто в скобки!
